{
  "backend/main.mo": "Motoko actor implementing user profiles, approval workflow, access control, and payment proof submission with storage integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/android/.gitignore": "Gitignore rules excluding Android build outputs, signing files, IDE metadata, and generated project files.",
  "frontend/android/README.md": "Documentation explaining the Android TWA wrapper setup, prerequisites, and build process for APK packaging.",
  "frontend/android/scripts/build-apks.mjs": "Node script that builds debug and release Android APKs, validates signing config, and copies artifacts for CI.",
  "frontend/android/scripts/validate-release-config.mjs": "Validation script ensuring TWA manifest, asset links, and signing files are correctly configured before release builds.",
  "frontend/android/signing/keystore.properties.example": "Template file showing required fields for Android signing configuration without real credentials.",
  "frontend/android/twa-manifest.json": "TWA manifest defining Android wrapper metadata, host URL, colors, icons, signing info, and SDK configuration.",
  "frontend/docs/android-apk-build.md": "Guide explaining prerequisites and steps for building debug and release APKs using Bubblewrap for the PWA.",
  "frontend/env.json": "Environment config storing backend canister ID and II derivation origin.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML entry point loading the PWA manifest, icons, and main React script.",
  "frontend/public/.well-known/assetlinks.json": "Digital Asset Links file declaring app package and certificate for TWA verification.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, icons, and splash screen.",
  "frontend/public/sw.js": "Service worker implementing asset caching, cache cleanup, and offline fallbacks.",
  "frontend/src/App.tsx": "Main app component wiring modules, reminders, service worker registration, and logout logic.",
  "frontend/src/backend/backend.did.ts": "Candid interface defining the backend healthCheck method.",
  "frontend/src/backend/index.ts": "Factory for creating backend actors using HttpAgent with optional identity.",
  "frontend/src/backend/types.ts": "Custom TypeScript definitions for backend approval status variants.",
  "frontend/src/components/Debug/DiagnosticsPanel.tsx": "Diagnostics UI showing captured logs with copy and clear actions.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary displaying error details and offering reload and copy options.",
  "frontend/src/config/branding.ts": "Centralized branding strings like app name and descriptions.",
  "frontend/src/config/pixPaywall.ts": "Pix paywall configuration including amount, key, and instructions.",
  "frontend/src/features/access/AccessGate.tsx": "Controls user access flow based on authentication, profile, approval, and payment status.",
  "frontend/src/features/access/components/AccessErrorState.tsx": "Renders standardized error states for access issues with optional retry and support actions. Supports network, disabled, unauthorized, and pending cases.",
  "frontend/src/features/access/hooks/useAccountGateState.ts": "Computes the user's access state by combining authentication, profile, approval, admin role, and paywall checks. Returns a structured gate status used for routing and gating UI.",
  "frontend/src/features/access/PaywallStatusScreen.tsx": "Displays paywall or payment review status based on the user's latest payment proof. Shows loading, pending, rejected, or approved states.",
  "frontend/src/features/admin/AdminPanel.tsx": "Provides the admin interface for managing user approvals and reviewing payment proofs. Displays tabs for approvals and payments with support for viewing detailed proof data.",
  "frontend/src/features/admin/components/PaymentProofReviewDrawer.tsx": "Drawer UI for admins to review and approve or reject a specific payment proof. Shows proof details, status badges, and mutation actions.",
  "frontend/src/features/admin/components/UserApprovalList.tsx": "Lists user approvals with filtering and allows admins to approve or reject pending users. Handles loading, error states, and displays status badges for each entry.",
  "frontend/src/features/admin/hooks/useAdminData.ts": "Provides admin hooks for listing and updating approvals, managing payment proofs, and assigning user roles. Wraps backend mutation and query hooks for admin operations.",
  "frontend/src/features/auth/AuthScreen.tsx": "Login screen prompting users to authenticate via Internet Identity. Shows branding, login button, and loading state during authentication.",
  "frontend/src/features/auth/ProfileSetupForm.tsx": "Form component that captures and validates user name and email, then saves the profile via a mutation hook.",
  "frontend/src/features/dashboard/components/ClientBoletoDetails.tsx": "Displays full boleto details with edit, delete, WhatsApp, and status update actions.",
  "frontend/src/features/dashboard/components/ClientBoletoForm.tsx": "Form for creating or editing a boleto with fields for client info, due date, value, status, and notes.",
  "frontend/src/features/dashboard/components/ClientBoletoReminderOverlay.tsx": "Alarm overlay showing an expiring boleto and providing snooze or mark-as-sent actions.",
  "frontend/src/features/dashboard/components/DashboardModule.tsx": "Main dashboard view that lists boletos, applies filters, shows metrics, and supports creating and viewing boleto details.",
  "frontend/src/features/dashboard/context/ClientBoletosContext.tsx": "Context managing boleto state with CRUD operations, status updates, snoozing, and persistent storage.",
  "frontend/src/features/dashboard/model/clientBoleto.ts": "Defines the ClientBoleto interface, boleto status types, and associated labels and colors.",
  "frontend/src/features/dashboard/reminders/useClientBoletoReminders.ts": "React hook that checks pending boletos for due reminders and exposes an active reminder with a dismiss function.",
  "frontend/src/features/dashboard/storage/clientBoletosStorage.ts": "LocalStorage wrapper for loading, validating, saving, and modifying ClientBoleto entries.",
  "frontend/src/features/dashboard/utils/alarmAudio.ts": "Utility to play and stop an 800Hz pulsing alarm sound using the Web Audio API.",
  "frontend/src/features/dashboard/utils/dueBuckets.ts": "Functions to bucket boletos by due date and filter by status, including labels and sorting.",
  "frontend/src/features/dashboard/utils/monthMetrics.ts": "Calculates dashboard metrics for pending boletos and provides a currency formatting helper.",
  "frontend/src/features/dashboard/utils/whatsapp.ts": "Normalizes phone numbers and opens WhatsApp links with platform‑specific deep‑link handling.",
  "frontend/src/features/leads/components/LeadDetails.tsx": "Lead details panel with view, edit, delete, and WhatsApp actions, pulling latest data from context.",
  "frontend/src/features/leads/components/LeadForm.tsx": "Form for creating and editing leads with validation and status, phone, notes, and follow‑up fields.",
  "frontend/src/features/leads/components/LeadReminderOverlay.tsx": "UI overlay for due follow-up reminders, showing lead info and allowing snooze or completion actions.",
  "frontend/src/features/leads/components/LeadsList.tsx": "Displays searchable, filterable lead list grouped by follow-up buckets with quick actions.",
  "frontend/src/features/leads/components/LeadsModule.tsx": "Main leads module wiring list, details panel, and creation dialog using context state.",
  "frontend/src/features/leads/context/LeadsContext.tsx": "Manages lead state, CRUD operations, follow-up updates, and persistence via local storage.",
  "frontend/src/features/leads/hooks/useLeads.ts": "Empty placeholder hook file.",
  "frontend/src/features/leads/model/lead.ts": "Defines Lead interface, status type, and label/color mappings.",
  "frontend/src/features/leads/reminders/useLeadReminders.ts": "Hook that detects due leads and exposes the active reminder with dismissal handling.",
  "frontend/src/features/leads/storage/leadsStorage.ts": "LocalStorage-backed persistence layer for loading, saving, and updating leads.",
  "frontend/src/features/leads/utils/followUpBuckets.ts": "Utility functions to classify, filter, sort, and label leads by follow-up timing.",
  "frontend/src/features/leads/utils/snoozeOptions.ts": "Provides preset snooze durations and helper to compute next follow-up time.",
  "frontend/src/features/leads/utils/whatsapp.ts": "Normalizes phone numbers and generates or opens WhatsApp deep links.",
  "frontend/src/features/paywall/hooks/usePaymentProofs.ts": "Provides helpers to fetch, submit, and update the user's latest payment proof using backend mutations.",
  "frontend/src/features/paywall/PaywallScreen.tsx": "Renders the paywall UI, handles file or code submission for payment proofs, and shows the latest proof status.",
  "frontend/src/features/settings/SettingsModule.tsx": "Displays user profile details, logout actions, and conditionally renders the admin panel if the user is an admin.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth flow, exposing identity, login, logout, and status through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query for user profiles, roles, approvals, paywall checks, and payment proof operations.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/lib/logCapture.ts": "Captures console errors, warnings, and uncaught exceptions into an in-memory log buffer for diagnostics.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClientProvider and InternetIdentityProvider before rendering the root component.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state, goals, architecture notes, known issues, and feature list for an offline-first Android reminder/CRM app with restricted access."
}