{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restricted access gate with Pix paywall, approval status, and admin panel (frontend-only)",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Gate the app UI behind authentication and account approval/enabled status so only approved+enabled users can access internal modules.",
      "acceptanceCriteria": [
        "When the user is not logged in, the app shows only an authentication + paywall flow (no Dashboard/Leads functionality is reachable).",
        "When the user is logged in but not payment-approved and/or disabled, the app shows only the paywall status screen (no internal features are reachable).",
        "When the user is logged in AND payment-approved AND enabled, the normal app features (Dashboard, Leads, etc.) are accessible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/access/AccessGate.tsx",
          "operation": "create",
          "description": "Create an AccessGate component that uses the existing Internet Identity session plus backend status checks (role, approval, paywall flag, and user profile enabled/activated) to decide whether to render (a) auth flow, (b) paywall/status flow, or (c) the main app shell. Use the authorization + user-approval component concepts for role/approval gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/AuthScreen.tsx",
          "operation": "create",
          "description": "Add an authentication screen that uses the existing Internet Identity plumbing to log in/out, and prompts for initial profile setup (name + email) when needed using backend profile methods. All user-facing text in this screen must be English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/ProfileSetupForm.tsx",
          "operation": "create",
          "description": "Create a minimal profile setup form (name + email) that saves the caller profile and handles validation + errors in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/access/PaywallStatusScreen.tsx",
          "operation": "create",
          "description": "Create a status-only screen shown to logged-in but not-approved/disabled users. It must clearly show current status (Pending review / Approved / Rejected / Disabled) and the next steps in English, and link into the paywall submission UI when applicable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/access/hooks/useAccountGateState.ts",
          "operation": "create",
          "description": "Create a React Query-based hook that fetches and normalizes the current user's gate state (authenticated, role, approved, paywall active, profile enabled/activated, existing payment proof statuses) for use by AccessGate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire AccessGate into the app so that gated users never render Dashboard/Leads modules or internal navigation. When AccessGate indicates allowed access, render the existing tabbed app; otherwise render the auth/paywall flow only."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add a paywall screen with Pix instructions and allow users to submit a transaction code and/or upload a payment proof file for admin review, with clear status feedback.",
      "acceptanceCriteria": [
        "Paywall screen displays: price amount, Pix key, and short instructions text (all user-facing text in English).",
        "User can submit: (a) a transaction code string, and/or (b) an uploaded proof file (stored in backend as bytes or a base64 string).",
        "Submission is associated with the logged-in user and is visible in the admin panel for review.",
        "User sees a clear status after submission (e.g., “Pending review”, “Approved”, “Rejected/Disabled”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/paywall/PaywallScreen.tsx",
          "operation": "create",
          "description": "Implement the paywall UI (English-only) that displays Pix amount/key/instructions from centralized config and provides submission UI for transaction code and/or file upload. Use the blob-storage component's ExternalBlob on the frontend to upload proof files. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/paywall/hooks/usePaymentProofs.ts",
          "operation": "create",
          "description": "Add hooks to load the current user's payment proof submissions and submit/update a payment proof, surfacing clear UI states (idle/submitting/success/error) and current proof status. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/access/PaywallStatusScreen.tsx",
          "operation": "modify",
          "description": "Integrate PaywallScreen into the status flow (e.g., show submission section when pending/no submission; show read-only status when already submitted). Ensure status messaging is in English and reflects backend-reported proof status."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Add an admin-only UI (embedded inside an existing main screen) to review users and payment submissions, approve/reject payments, and enable/disable users with live UI updates.",
      "acceptanceCriteria": [
        "Admin panel is not visible to non-admin users.",
        "Admin can view a list of users with status badges (e.g., Pending payment / Approved / Disabled).",
        "Admin can open a user row to view submitted transaction code and/or proof attachment, then approve payment and/or toggle enabled/disabled.",
        "All admin actions update UI state without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "create",
          "description": "Create an AdminPanel UI that is rendered only when the current user is admin (using the authorization component role checks). Provide list views for approvals and payment proofs with status badges, and actions to approve/reject proofs and manage user state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/components/UserApprovalList.tsx",
          "operation": "create",
          "description": "Implement a focused list component to display registrations/approvals with filters (e.g., pending only) and status badges; use React Query for fetching and cache updates. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/components/PaymentProofReviewDrawer.tsx",
          "operation": "create",
          "description": "Create a review UI for a selected payment proof showing transaction code and/or proof attachment (using ExternalBlob direct URL when available), with approve/reject actions and optimistic UI updates. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/hooks/useAdminData.ts",
          "operation": "create",
          "description": "Add React Query hooks for admin-only reads/actions (list approvals, list payment proofs by status, update proof status, assign roles if needed). Ensure cache invalidation keeps UI updated without full refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/settings/SettingsModule.tsx",
          "operation": "create",
          "description": "Create a Settings module that contains account info (role/approval/payment state) for all users and conditionally renders the AdminPanel for admin users. All newly introduced user-facing text must be English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire SettingsModule into the activated app navigation as an additional tab and ensure AdminPanel is only reachable/visible inside Settings for admins."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Keep activated navigation to no more than three main screens while integrating access gating and the admin panel.",
      "acceptanceCriteria": [
        "App keeps navigation to a maximum of three main screens when activated (e.g., Home/Dashboard, Leads, Settings).",
        "Admin panel is integrated without adding a fourth main screen (e.g., as an admin-only section within Settings).",
        "When gated (not logged in / not approved / disabled), navigation elements to internal modules are not shown or are disabled and cannot be accessed via URL/tab state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the tab navigation to at most three tabs (Dashboard, Leads, Settings) when AccessGate allows access, and remove/disable internal navigation entirely when gated. Ensure tab state cannot be used to render internal modules unless allowed."
        },
        {
          "path": "frontend/src/features/access/AccessGate.tsx",
          "operation": "modify",
          "description": "Ensure the gating layer fully controls whether the main tabbed UI is mounted at all, preventing access by direct tab state restoration or URL query manipulation."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Enforce restricted access defensively in the UI and provide actionable English error states for auth/network/disabled/unapproved scenarios.",
      "acceptanceCriteria": [
        "Frontend prevents access to internal modules unless account is approved+enabled (UI gating).",
        "Backend rejects admin operations for non-admin callers.",
        "Frontend shows actionable error messages (in English) for auth failures, network failures, and disabled/unapproved account states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/access/components/AccessErrorState.tsx",
          "operation": "create",
          "description": "Create reusable UI for showing actionable errors in English (e.g., 'Network error—try again', 'Your account is disabled—contact support', 'Payment pending review'), and standardize how backend authorization traps are displayed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/access/AccessGate.tsx",
          "operation": "modify",
          "description": "Integrate AccessErrorState for all gate-related failures (actor unavailable, backend call failures, unauthorized/admin-only traps), and ensure the user sees clear next steps in English."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Ensure admin-only views and actions handle authorization failures gracefully (English messaging) and never render for non-admin users (defensive UI checks in addition to backend enforcement). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Centralize Pix paywall display values (amount, Pix key, instructions) in one frontend config module and read from it in the paywall UI.",
      "acceptanceCriteria": [
        "Pix price/key/instructions are defined in a single frontend config module (can reuse or extend existing branding config pattern).",
        "Paywall screen reads from this centralized config.",
        "No user-visible paywall strings are hardcoded across multiple components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/pixPaywall.ts",
          "operation": "create",
          "description": "Create a centralized Pix paywall config module exporting price amount, Pix key, and English instructions text so values can be changed in one place."
        },
        {
          "path": "frontend/src/features/paywall/PaywallScreen.tsx",
          "operation": "modify",
          "description": "Read Pix amount/key/instructions from the centralized config module and avoid duplicating user-facing paywall strings elsewhere."
        }
      ]
    }
  ]
}